LANG = {
    "loading_modules": "🔄 Загружаем модули...",
    "module_loaded": "✅ Модуль {name} успешно загружен!",
    "module_error": "❌ Ошибка загрузки модуля {name}: {error}",
    "missing_register": "⚠️ В модуле {name} отсутствует функция 'register_module'.",
    "userbot_started": "🚀 Юзер-бот успешно запущен!",
    "choose_language": "🌍 *Выберите язык:*",
    "language_changed": "✅ Язык изменён на Русский 🇷🇺. Введите .restart, чтобы перезапустить бота.",
    "language_changed_terminal": "✅ Язык изменён на Русский 🇷🇺. Введите .restart, чтобы перезапустить бота.",
    "restart_message": "🔄 Перезагрузка бота...",
    "restart_completed": "✅ Бот перезапущен!",
    "restart_message_terminal": "🔄 Перезапуск бота в терминале...",
    
    "module_error": "❌ Ошибка загрузки модуля {name}: {error}",
    "missing_register": "⚠️ В модуле {name} отсутствует функция 'register_module'.",
    
    # Дополнительные переводы
    "no_modules_to_delete": "❌ Нет доступных модулей для удаления.",
    "select_module_to_delete": "Выберите модуль для удаления: Будьте внимательны, если вы удалите модуль, который не устанавливали, функции юзер бота могут не работать.",
    "module_deleted": "✅ Модуль {0} удален!",
    "module_not_found": "❌ Модуль {0} не найден на сервере.",
    "module_cannot_delete": "❌ Модуль {0} не может быть удален, так как он запрещен для удаления.",
    'greeting': 'Привет!',
    'choose_action': 'Выберите действие:',
}
