LANG = {
    "loading_modules": "🔄 Завантаження модулів...",
    "module_loaded": "✅ Модуль {name} успішно завантажено!",
    "module_error": "❌ Помилка завантаження модуля {name}: {error}",
    "missing_register": "⚠️ У модулі {name} відсутня функція 'register_module'.",
    "userbot_started": "🚀 Юзер-бот успішно запущено!",
    "choose_language": "🌍 *Оберіть мову:*",
    "language_changed": "✅ Мову змінено на Українську 🇺🇦. Введіть .restart, щоб перезапустити бота.",
    "language_changed_terminal": "✅ Мову змінено на Українську 🇺🇦. Введіть .restart, щоб перезапустити бота.",
    "restart_message": "🔄 Перезавантаження бота...",
    "restart_completed": "✅ Бот перезапущено!",
    "restart_message_terminal": "🔄 Перезапуск бота в терміналі...",

    # Кнопки
    "settings": "Налаштування ⚙️",
    "choose_language_message": "Оберіть мову:",
    "all_modules": "Всі модулі 📦",
    "delete_module": "Видалити модуль 🗑️",
    "load_module": "Завантажити модуль ⬆️",
    "language_changed": "✅ Мову змінено!",
    "russian": "Русский 🇷🇺",
    "ukrainian": "Українська 🇺🇦",
    "english": "English 🇬🇧",
    "all_modules_list": "Всі модулі:",
    "settings_message": "⚙️ Налаштування:",

    # Для інтерфейсу вибору мови
    "choose_language": "🌍 Оберіть мову:",
    "language_changed": "✅ Мову змінено на Українську 🇺🇦. Введіть .restart, щоб перезапустити бота.",
    "language_changed_terminal": "✅ Мову змінено на Українську 🇺🇦. Введіть .restart, щоб перезапустити бота.",
    
    "module_error": "❌ Помилка завантаження модуля {name}: {error}",
    "missing_register": "⚠️ У модулі {name} відсутня функція 'register_module'.",

    # Додаткові переклади
    "no_modules_to_delete": "❌ Немає доступних модулів для видалення.",
    "select_module_to_delete": "Оберіть модуль для видалення: Будь ласка, будьте обережні, якщо ви видалите модуль, який не було встановлено, функції юзер-бота можуть не працювати.",
    "module_deleted": "✅ Модуль {0} видалено!",
    "module_not_found": "❌ Модуль {0} не знайдено на сервері.",
    "module_cannot_delete": "❌ Модуль {0} не можна видалити, оскільки він заборонений до видалення.",
}
